invoice-data-performance/src/test/resources/data/ViewInvoiceData_OK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:sll:invoicedata:ViewInvoiceDataResponder:1">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:ViewInvoiceDataRequest>
         <urn1:referenceId>1</urn1:referenceId>
         <!--You may enter ANY elements at this point-->
      </urn1:ViewInvoiceDataRequest>
   </soapenv:Body>
</soapenv:Envelope>